worker/app/controllers/tasks_controller.rb

  def index
    #@tasks = Task.all
    # insert call here to server
    #@tasks = [
     # ["1", "http://rafalab.jhsph.edu/simplystats/dongle-capitalism.jpg", "open"],
     # ["2", "http://williamkaminsky.files.wordpress.com/2006/06/whiteboard2.jpg", "open"]
    #]
    response = HTTParty.get('http://default-environment-jrcyxn2kkh.elasticbeanstalk.com/task/open
')
    #@tasks = Array.new
    #i = 0
    response.parsed_response.each do |k, v|
      v.each do |a|
        puts "" + a.to_s



        if !Task.exists?(:xim_id  => a["serverUniqueRequestId"])
          t = Task.new
          t.xim_id = a["serverUniqueRequestId"]
         t.imageurl = a["imageUrl"]
          puts "SAVING T.... " + t.to_s
          t.save
---
SELECT "tasks".* FROM "tasks"
SELECT 1 AS one FROM "tasks" WHERE "tasks"."xim_id" = '556bb8f0-0fcb-4904-9fb0-d9054ec2d7fc' LIMIT 1
INSERT INTO "tasks" ("id","xim_id","created_at","updated_at","imageurl","output") VALUES (NULL,'9803a2c2-3e28-44de-a8e2-2a8ef02aa3ff','2013-02-01 02:39:47.511396','2013-02-01 02:39:47.511423','https://s3.amazonaws.com/ximly_test1/9803a2c2-3e28-44de-a8e2-2a8ef02aa3ff.png',NULL)

      end
    end
    #@tasks = Task.all
    @tasks = Task.paginate(:page => params[:page], :per_page => 5)
---
SELECT "tasks".* FROM "tasks" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "tasks"

  def edit
    #@task = Task.find(params[:id])
    puts "**********Task id is" + params[:id]
    @task = Task.find_by_xim_id(params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."xim_id" = '556bb8f0-0fcb-4904-9fb0-d9054ec2d7fc' LIMIT 1

  def create
    puts "CREATING..."
    @task = Task.new(params[:task])

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("created_at", "updated_at", "xim_id") VALUES (?, ?, ?)  [["created_at", Sun, 27 Jan 2013 19:44:07 UTC +00:00], ["updated_at", Sun, 27 Jan 2013 19:44:07 UTC +00:00], ["xim_id", 1]]

  def update

    puts "UPDATING...."
    @task = Task.find(params[:id])
    output = @task.output

    options = {
      :body => {
        :serverUniqueRequestId => @task.xim_id,
        :output => output
      }
    }

    r = HTTParty.post('http://default-environment-jrcyxn2kkh.elasticbeanstalk.com/task/submit', options)
    puts "response ======" + r.to_s





    #puts "OUTPUT...." + output
    respond_to do |format|
      if @task.update_attributes(params[:task])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "37"]]
UPDATE "tasks" SET "output" = 'asdfasdfasdf', "updated_at" = '2013-01-28 17:05:41.876417' WHERE "tasks"."id" = 37